## PANDAS - Groupby

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['SAM','CHARLIE','AMY','VANESSA','CAR1','SARAH'],
        'Sales':[200,120,340,124,243,350]
        }

In [7]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      SAM    200
1    GOOG  CHARLIE    120
2    MSFT      AMY    340
3    MSFT  VANESSA    124
4      FB     CAR1    243
5      FB    SARAH    350

In [20]:
bycom = df.groupby('Company')

In [31]:
bycom.sum()
bycom.mean()

             Person  Sales
Company
FB        CAR1SARAH    593
GOOG     SAMCHARLIE    320
MSFT     AMYVANESSA    464

In [33]:
df.groupby('Company').sum().loc['FB']

Person    CAR1SARAH
Sales           593
Name: FB, dtype: object

In [34]:
df.groupby("Company").max()

          Person  Sales
Company
FB         SARAH    350
GOOG         SAM    200
MSFT     VANESSA    340

In [37]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000